results/600w/probe/n2_RedHat_auto/promptopt_c1024_p8003.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f771fb20040>, trust_remote_code=True, seed=9068, num_prompts=2048, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=256, random_range_ratio='0', random_prefix_len=3072, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8003', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=256, model='q27', input_len=None, output_len=None, tokenizer='/workspace/models/Qwen27B-NVFP4-RedHat', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/results/probe/n2_RedHat_auto', result_filename='n2_RedHat_auto__promptopt__c1024__p8003.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-bdea3ceb-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-03 14:00:17 [utils.py:90] Sampling input_len from [512, 512] and output_len from [256, 256]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 256
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     2048      
Failed requests:                         0         
Maximum request concurrency:             256       
Benchmark duration (s):                  1050.00   
Total input tokens:                      7340032   
Total generated tokens:                  524288    
Request throughput (req/s):              1.95      
Output token throughput (tok/s):         499.32    
Peak output token throughput (tok/s):    2304.00   
Peak concurrent requests:                265.00    
Total token throughput (tok/s):          7489.85   
---------------Time to First Token----------------
Mean TTFT (ms):                          12670.12  
Median TTFT (ms):                        5964.55   
P50 TTFT (ms):                           5964.55   
P90 TTFT (ms):                           24136.36  
P99 TTFT (ms):                           100370.00 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          464.09    
Median TPOT (ms):                        490.18    
P50 TPOT (ms):                           490.18    
P90 TPOT (ms):                           490.40    
P99 TPOT (ms):                           496.58    
---------------Inter-token Latency----------------
Mean ITL (ms):                           464.09    
Median ITL (ms):                         120.03    
P50 ITL (ms):                            120.03    
P90 ITL (ms):                            1496.66   
P99 ITL (ms):                            1544.81   
----------------End-to-end Latency----------------
Mean E2EL (ms):                          131012.66 
Median E2EL (ms):                        130980.44 
P50 E2EL (ms):                           130980.44 
P90 E2EL (ms):                           145180.38 
P99 E2EL (ms):                           219201.96 
==================================================